//影隐劫（ZGT）
#include <I2C.h>
/*******************************************************************************
* 函数名         :delay_5us()
* 函数功能     	 :延时5us用于适应I2C中各种延时的需求
* 输入           :无
* 输出           :无
*******************************************************************************/
void delay_5us(void)
{
	
}

/*******************************************************************************
* 函数名         :IIC_Start()
* 函数功能     	 :发送一个起始信号
* 输入           :无
* 输出           :无
*******************************************************************************/
void IIC_Start(void)
{
    SDA = 1;        //需在SCL之前设定
    SCL = 1;        //硬件进入SDA检测状态
    delay_5us();    //延时至少4.7us
    SDA = 0;        //SDA由1->0,产生开始信号
    delay_5us();    //延时至少4us
    SCL = 0;        //SCL变为无效
}
/*******************************************************************************
* 函数名         :IIC_Stop()
* 函数功能     	 :发送一个停止信号
* 输入           :无
* 输出           :无
*******************************************************************************/
void IIC_Stop(void)
{
    SDA = 0;        //在SCL之前拉低
    SCL = 1;        //硬件进入SDA检测状态
    delay_5us();    //至少延时4us
    SDA = 1;        //SDA由0->1,产生结束信号
    delay_5us();    //延时至少4.7us
}
/*******************************************************************************
* 函数名         :IIC_Send_ACK(bit ack)
* 函数功能     	 :主机向从机发送一个应答信号
* 输入           :1应答；0非应答
* 输出           :无
*******************************************************************************/
void IIC_Send_ACK(bit ack)
{
    SDA = ack;      //产生应答电平
	delay_5us();
    SCL = 1;        //发送应答信号
    delay_5us();    //延时至少4us
    SCL = 0;        //整个期间保持应答信号
}
/*******************************************************************************
* 函数名         :IIC_Get_ACK()
* 函数功能     	 :检测从机是否应答
* 输入           :无
* 输出           :1非应答；0应答
*******************************************************************************/
bit IIC_Get_ACK(void)
{
    bit ret;        //用来接收返回值
    SDA = 1;        //电阻上拉,进入读
	delay_5us();
    SCL = 1;        //进入应答检测
    delay_5us();    //至少延时4us
    ret = SDA;      //保存应答信号
    SCL = 0;
    return ret;
}
/*******************************************************************************
* 函数名         :bit IIC_Write_Byte(unsigned char dat)
* 函数功能     	 :主机发送一个字节
* 输入           :需要发送的字节
* 输出           :应答信号
*******************************************************************************/
bit IIC_Write_Byte(unsigned char dat)
{
	bit ack;
    unsigned char loop = 8;     //必须为一个字节
    while(loop--){
        // 高在前低在后
		if (dat & 0x80)
			SDA = 1;
		else
			SDA = 0;
        delay_5us();
		SCL = 1;
        delay_5us();    //延时至少4us
        SCL = 0;
        dat <<= 1;      //低位向高位移动
    }
	
	ack = IIC_Get_ACK();
	
	return ack;
}
/*******************************************************************************
* 函数名         :I2C_Read_Byte(bit ack)
* 函数功能     	 :主机通过I2C读取一个字节
* 输入           :需要发送的应答信号
* 输出           :读取到的字节
*******************************************************************************/
unsigned char IIC_Read_Byte(bit ack)
{
    unsigned char loop = 8;     //必须为一个字节
    unsigned char ret = 0;
	// SDA 设置输入方向
    SDA = 1;
    while(loop--){
		ret <<= 1;
		SCL = 1;
		delay_5us();
        // 高在前低在后
        if(SDA){
			ret++;
		}
        SCL = 0;
        delay_5us();
    }
	
	IIC_Send_ACK(ack);
	
    return ret;
}