//影隐劫(ZGT)
#include "Delay.h"
/*******************************************************************************
* 函数名         :Delay_Ms_(ms)
* 函数功能     	 :延时ms毫秒
* 输入           :ms毫秒
* 输出           :无
*******************************************************************************/
void Delay_Ms_(unsigned int ms)
{
	unsigned int i;
	do{
		i = Main_Fosc / 96000;
		while(--i);
	}while(--ms);
}
/*******************************************************************************
* 函数名         :Delay_5us_
* 函数功能     	 :延时5us
* 输入           :无
* 输出           :无
*******************************************************************************/
//void Delay_5us_(void)
//{
//	#if Main_Fosc == 11059200	
//  		 _nop_();	//这里只采用一个_nop_指令是因为进入和退出该函数需要2个机器周期
//   					//再执行一个机器周期恰好5个5us多一点毕竟有点误差
//	#elif Main_Fosc == 12000000
//   		_nop_();
//	#elif Main_Fosc == 22118400
//		_nop_();_nop_();_nop_();
//	#endif
//}